[ABB_Agent X2SoldierClassTemplate]
DisplayName="Agent"
ClassSummary="Agents can be used as stealthy snipers, but are best at assassinating enemies at close range with a shotgun. Their combat knife provides utility and mobility."
LeftAbilityTreeTitle="Agent"
RightAbilityTreeTitle="Operative"
AbilityTreeTitles[0]="Agent"
AbilityTreeTitles[1]="Operative"
AbilityTreeTitles[2]="Operative"
AbilityTreeTitles[3]="XCOM"
;ALPHABETICAL ORDER... NOT!
RandomNickNames[0]="Double-Oh"
RandomNickNames[1]="Blitz"
RandomNickNames[2]="Stab"
RandomNickNames[3]="Butcher"
RandomNickNames[4]="Sinew"
RandomNickNames[5]="Rogue"
RandomNickNames[6]="Ghost"
RandomNickNames[7]="Cloak"
RandomNickNames[8]="Dagger"
RandomNickNames[9]="Edge"
RandomNickNames[10]="Cutter"
RandomNickNames[11]="Licensed"
RandomNickNames[12]="Enforcer"
RandomNickNames[13]="Fatal"
RandomNickNames[14]="Flash"
RandomNickNames[15]="Jury"
RandomNickNames[16]="Judge"
RandomNickNames[17]="Stranger"
RandomNickNames[18]="One-Two"
RandomNickNames[19]="Greyhound"
RandomNickNames[20]="No Trace"
RandomNickNames[21]="Fang"
RandomNickNames[22]="Bloodletter"
RandomNickNames[23]="Casanova"
RandomNickNames[24]="Big One"
RandomNickNames[25]="Blast"
RandomNickNames[26]="Mustang"
RandomNickNames[27]="Paladin"
RandomNickNames[28]="Pitbull"
RandomNickNames[29]="Predator"
RandomNickNames[30]="Razor"
RandomNickNames[31]="Samurai"
RandomNickNames[32]="Scorpion"
RandomNickNames[33]="Shogun"
RandomNickNames[34]="Shadow"
RandomNickNames[35]="Slayer"
RandomNickNames[36]="Snake"
RandomNickNames[37]="Snake Eyes"
RandomNickNames[38]="Solo"
RandomNickNames[39]="Specter"
RandomNickNames[40]="Spider"
RandomNickNames[41]="Stalker"
RandomNickNames[42]="Steel"
RandomNickNames[43]="Stinger"
RandomNickNames[44]="Last Gasp"
RandomNickNames[45]="Trojan"
RandomNickNames[46]="Tinker"
RandomNickNames[47]="Neo"
RandomNickNames[48]="Warden"
RandomNickNames[49]="Warlord"
RandomNickNames[50]="Wolverine"
;ALPHABETICAL ORDER... lol
RandomNickNames_Male[0]="Womanizer"
RandomNickNames_Male[1]="Gentleman"
RandomNickNames_Male[2]="Guy"
RandomNickNames_Male[3]="Stallion"
RandomNickNames_Male[4]="Q"
;ALPHABETICAL ORDER
RandomNickNames_Female[0]="Athena"
RandomNickNames_Female[1]="Duchess"
RandomNicknames_Female[2]="Iron Lady"
RandomNicknames_Female[3]="Black Widow"
RandomNicknames_Female[4]="Executor"
RandomNickNames_Female[5]="Valkyrie"
;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="His blade... THEIR BLOOD!"
PhotoboothSoloBLines_Male[1]="The last thing you never see."
PhotoboothSoloBLines_Male[2]="His blade will bring JUSTICE!"
PhotoboothSoloBLines_Male[3]="Close, Personal, and DEADLY!"
PhotoboothSoloBLines_Male[4]="Blademaster. Death Dealer."
PhotoboothSoloBLines_Female[0]="Her blade... THEIR BLOOD!"
PhotoboothSoloBLines_Female[1]="The last thing you never see."
PhotoboothSoloBLines_Female[2]="Her blade will bring JUSTICE!"
PhotoboothSoloBLines_Female[3]="Close, Personal, and DEADLY!"
PhotoboothSoloBLines_Female[4]="Blademaster. Death Dealer."
